area_list = {
        "가로수길":["신사동","신사"], 
        "강남역":["강남","신논현", "신논현역"],
        "건대":["건대입구"],
        "경리단길":["경리단"],
        "광화문":["광화문역"],
        # "남양주":[""],
        "대학로":["혜화"],
        "망원":["망원동"],
        "명동":["명동역"],
        "문래":["문래역"],
        "북촌":["경복궁역"],
        "분당":["서현역"],
        "상수":["상수동"],
        "샤로수길":["서울대입구역"],
        # "서래마을":[""],
        # "서촌":[""],
        "성수":["성수동","성수역","서울숲","서울숲역","뚝섬","뚝섬역"],
        # "송도":[""],
        # "압구정":[""],
        # "양재":[""],
        # "양평":[""],
        # "여의도":[""],
        # "연남":[""],
        # "을지로":[""],
        # "이태원":[""],
        # "익선동":[""],
        # "인사동":[""],
        # "일산":[""],
        # "잠실":[""],
        # "종로":[""],
        # "청담동":[""],
        # "한남동":[""],
        # "합정":[""],
        # "해방촌":[""],
        # "홍대":[""]
    }

search_list = {
    "가로수길":["신사동","신사"], 
    "강남역":["강남","신논현", "신논현역"],
    "건대":["건대입구"],
    "경리단길":["경리단"],
    "광화문":["광화문역"],
    # "남양주":[""],
    "대학로":["혜화"],
    "망원":["망원동"],
    "명동":["명동역"],
    "문래":["문래역"],
    "북촌":["경복궁역"],
    "분당":["서현역"],
    "상수":["상수동"],
    "샤로수길":["서울대입구역"],
    # "서래마을":[""],
    # "서촌":[""],
    "성수":["서울숲맛집", "성수맛집", "뚝섬맛집", "서울숲역맛집", "성수역맛집", "뚝섬역맛집", "성수동맛집"],
    # "송도":[""],
    # "압구정":[""],
    # "양재":[""],
    # "양평":[""],
    # "여의도":[""],
    # "연남":[""],
    # "을지로":[""],
    # "이태원":[""],
    # "익선동":[""],
    # "인사동":[""],
    # "일산":[""],
    # "잠실":[""],
    # "종로":[""],
    # "청담동":[""],
    # "한남동":[""],
    # "합정":[""],
    # "해방촌":[""],
    # "홍대":[""]
}

def map_query_to_venue(query):
    if query in search_list:
        return query
    for k in search_list.keys():
        if query in search_list[k]:
            return k
    return None

def validate_area_name(area_name):
    if area_name in area_name:
        return True
    return False


def get_search_list(area_name):
    if area_name in area_list:
        return search_list[area_name]
    return None

if __name__ == "__main__":
    map_query_to_venue("서울숲맛집")