invalid_tags =  [
        "서울숲커피", "서울숲맛집", "서울숲카페", "서울숲", "cafe", "coffe", "인테리어", "사진맛집", "맛집"
        ]

keywords = [
        "커피", "맛집", "cafe", "coffee", "존맛" "인테리어", "푸드스타그램", "먹스타그램", "일상", "먹방"
]

area_list = [
        "가로수길", 
        "강남역",
        "건대",
        "경리단길",
        "광화문",
        "남양주",
        "대학로",
        "망원",
        "명동",
        "문래",
        "북촌",
        "분당",
        "상수",
        "샤로수길",
        "서래마을",
        "서촌",
        "성수",
        "송도",
        "압구정",
        "양재",
        "양평",
        "여의도",
        "연남",
        "을지로",
        "이태원",
        "익선동",
        "인사동",
        "일산",
        "잠실",
        "종로",
        "청담동",
        "한남동",
        "합정",
        "해방촌",
        "홍대"
]

